<a href="https://colab.research.google.com/github/IlTACK-OH/pandas_practice/blob/main/day5/10_practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 제곱 함수와 n 제곱 함수 만들기

In [2]:
# 제곱 함수
def my_sq(x):
  return x**2

# n제곱 함수
def my_exp(x,n):
  return x**n

In [3]:
print(my_sq(4))

16

In [4]:
print(my_exp(2,4))

16

# 시리즈와 apply 메서드

다음 실습을 통하여 `apply` 메서드의 사용법을 알아보겠다.<br> `apply`메서드로 브로드캐스팅한 결과가 올바른 값인지 확인하기 위해 시리즈,<br> 데이터프레임의 기초 연산 결과와 비교하며 실습을 진행하겠다.

In [5]:
import pandas as pd

df = pd.DataFrame({'a':[10,20,30],'b':[20, 30, 40]})
df

    a   b
0  10  20
1  20  30
2  30  40

앞 서 만든 제곱 함수를 사용하기 전 a열을 제곱하여 얻은 결과를 출력하고,<br> 이를 `apply`메서드를 적용한 결괏값과 비교해 보겠다.

In [6]:
df['a']**2

0    100
1    400
2    900
Name: a, dtype: int64

In [7]:
# apply 메서드에 전달하는 함수가 1개의 인자를 받도록 구성되어 있을 경우
sq = df['a'].apply(my_sq)
sq

0    100
1    400
2    900
Name: a, dtype: int64

In [8]:
# apply 메서드에 전달하는 함수가 2개의 인자를 받도록 구성되어 있을 경우
ex = df['a'].apply(my_exp,n=2)
ex

0    100
1    400
2    900
Name: a, dtype: int64

In [9]:
ex = df['a'].apply(my_exp,n=3)
ex

0     1000
1     8000
2    27000
Name: a, dtype: int64

# 데이터 프레임과 apply 메서드

이번에는 시리즈가 아니라 데이터프레임에 apply메서드를 사용하는 방법에 대해서 알아보겠다.

In [10]:
df = pd.DataFrame({'a':[10,20,30],'b':[20,30,40]})
df

    a   b
0  10  20
1  20  30
2  30  40

In [12]:
def print_me(x):
  print(x)

이번에는 데이터프레임에 함수를 적용해야 하기 때문에 함수를 열 방향으로 적용할지 행 방향으로 적용할지 정해야 한다.<br> axis인잣값을 0이나 1로 지정하면 함수를 열 또는 행 방향으로 적용할 수 있다.

In [15]:
df.apply(print_me, axis =0)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

이번에는 3개의 인자를 입력받아 평균을 계산하는 함수를 사용해 보겠다.

In [16]:
def avg_3(x,y,z):
  return (x+y+z)/3

In [17]:
df.apply(avg_3)

TypeError: ignored

`avg_3`함수에 열 단위 데이터가 전달되었고 이 값을 `avg_3`함수에서 1개의 인자로 인식하여 오류가 발생한다.<br><br>따라서 `avg_3`함수가 열 단위로 데이터를 처리할 수 있도록 수정해야 한다.

In [18]:
def avg_3_apply(col):
  x=col[0]
  y=col[1]
  z=col[2]
  return (x+y+z)/3

In [19]:
df.apply(avg_3_apply)

a    20.0
b    30.0
dtype: float64

앞의 함수 코드는 데이터프레임의 행 개수가 3이라는 것을 알고 있다는 전제하에 작성하였다.<br>
하지만 일반적으로는 for문을 이용하여 다음과 같이 작성한다.

In [20]:
def avg_3_apply(col):
  sum = 0
  for item in col:
    sum+=item
  return sum/df.shape[0]

위 함수를 응용하면 행 방향으로 데이터를 처리하는 함수도 만들 수 있다.<br>마지막 return문의 df.shape[0]을 df.shape[1]로 바꾸면 된다.

In [21]:
def avg_2_apply(col):
  sum = 0
  for item in col:
    sum+=item
  return sum/df.shape[1]

In [22]:
df.apply(avg_2_apply,axis=1)

0    15.0
1    25.0
2    35.0
dtype: float64

# apply 메서드 사용하기 - 고급
이번에는 조금 더 큰 데이터를 사용하여 실습을 진행해 보겠다.<br>이번에 사용할 데이터는 `seaborn`라이브러리의 `titanic`데이터 집합이다.

# 데이터프레임의 누락값을 처리한 다음 apply 메서드 사용하기 - 열 방향

In [24]:
import seaborn as sns

titanic=sns.load_dataset('titanic')
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

다음은 누락값의 개수를 반환하는 `count_missing`함수를 만들어보겠다.

In [25]:
import numpy as np

def count_missing(vec):
  null_vec = pd.isnull(vec)
  null_count = np.sum(null_vec)
  return null_count

In [26]:
cmis_col = titanic.apply(count_missing)
cmis_col

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

다음은 누락값의 비율을 계산하는 `prop_missing`함수를 만들어보겠다.

In [27]:
def prop_missing(vec):
  num = count_missing(vec)
  dem = vec.size
  return num/dem

In [29]:
pmis_col = titanic.apply(prop_missing)
pmis_col

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

`prop_missing`함수를 이용하면 누락값이 아닌 데이터의 비율도 구할 수 있다.

In [30]:
def prop_complete(vec):
  return 1 - prop_missing(vec)

# 데이터프레임의 누락값을 처리한 다음 apply 메서드 사용하기 - 행 방뱡

앞 서 만든 함수를 `axis`를 1로 설정하여 행 방향으로 적용하여 실행해보겠다.

In [31]:
cmis_row = titanic.apply(count_missing, axis = 1)
pmis_row = titanic.apply(prop_missing, axis = 1)
pcom_row = titanic.apply(prop_missing, axis = 1)

In [32]:
cmis_row.head()

0    1
1    0
2    1
3    0
4    1
dtype: int64

In [33]:
pmis_row.head()

0    0.066667
1    0.000000
2    0.066667
3    0.000000
4    0.066667
dtype: float64

In [34]:
pcom_row.head()

0    0.066667
1    0.000000
2    0.066667
3    0.000000
4    0.066667
dtype: float64

다음은 누락값의 개수를 구하여 titanic 데이터프레임에 추가한 것이다.<br>
데이터프레임에 num_missing 열이 추가된 것을 알 수 있다.

In [37]:
titanic['num_missing'] = titanic.apply(count_missing, axis = 1)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1

누락값이 있는 데이터를 데이터프레임에 추가했기 때문에 누락값이 있는 데이터만 따로 모아서 볼 수 있다.

In [38]:
titanic.loc[titanic.num_missing >1,:].sample(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,2
270,0,1,male,NaN,0,0,31.0000,S,First,man,True,NaN,Southampton,no,True,2
568,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,2
214,0,3,male,NaN,1,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,False,2
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,2
425,0,3,male,NaN,0,0,7.2500,S,Third,man,True,NaN,Southampton,no,True,2
564,0,3,female,NaN,0,0,8.0500,S,Third,woman,False,NaN,Southampton,no,True,2
264,0,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,no,True,2
444,1,3,male,NaN,0,0,8.1125,S,Third,man,True,NaN,Southampton,yes,True,2
77,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2